      ******************************************************************
      * Copia del archivo de alumnos.txt
      ******************************************************************
       01 WS-ENT-ALUMNOS.
           05 FECHA                    PIC X(10).
           05 APELLIDO-NOMBRE          PIC X(40).
           05 MATERIA                  PIC X(30).
           05 NOTA                     PIC 9(5)V999.
