      ******************************************************************
      * Copia del archivo de ERROR-REGISTRO.TXT
      ******************************************************************
       01 WS-SAL-ERROR-REGISTRO                PIC X(88).

      *    05 WS-SAL-ERROR-FECHA                    PIC X(10).
      *    05 WS-SAL-ERROR-APE-NOM                  PIC X(40).
      *    05 WS-SAL-ERROR-MATERIA                  PIC X(30).
      *    05 WS-SAL-ERROR-NOTA                     PIC 9(5)V999.
