       01 WS-SALIDA-ERROR-EXTRA.

          05 WS-SAL-ERR-SIN-EXTRA.
             10 FILLER                      PIC X(15)
                                            VALUE 'El empleado ID '.
             10 WS-SAL-ERR-EXTRA-EMPLEADO      PIC X(08).
             10 FILLER                      PIC X(22)
                       VALUE ' no posee dato extra'.
